JiriS97/BMIC-Projects/CV09/Lib/mc9s08lh64.c
/* * * * *  16-BIT REGISTERS  * * * * * * * * * * * * * * * */
volatile ADCRASTR _ADCRA;                                  /* Data Result Register A; 0x00000014 */
volatile ADCRBSTR _ADCRB;                                  /* Data Result Register B; 0x00000016 */
volatile SCI1BDSTR _SCI1BD;                                /* SCI1 Baud Rate Register; 0x00000020 */
volatile TPM1CNTSTR _TPM1CNT;                              /* TPM1 Timer Counter Register; 0x00000041 */
volatile TPM1MODSTR _TPM1MOD;                              /* TPM1 Timer Counter Modulo Register; 0x00000043 */
volatile TPM1C0VSTR _TPM1C0V;                              /* TPM1 Timer Channel 0 Value Register; 0x00000046 */
volatile TPM1C1VSTR _TPM1C1V;                              /* TPM1 Timer Channel 1 Value Register; 0x00000049 */
volatile TPM2CNTSTR _TPM2CNT;                              /* TPM2 Timer Counter Register; 0x00000051 */
volatile TPM2MODSTR _TPM2MOD;                              /* TPM2 Timer Counter Modulo Register; 0x00000053 */
volatile TPM2C0VSTR _TPM2C0V;                              /* TPM2 Timer Channel 0 Value Register; 0x00000056 */
volatile TPM2C1VSTR _TPM2C1V;                              /* TPM2 Timer Channel 1 Value Register; 0x00000059 */
volatile SDIDSTR _SDID;                                    /* System Device Identification Register; 0x00001806 */
volatile DBGCASTR _DBGCA;                                  /* Debug Comparator A Register; 0x00001810 */
volatile DBGCBSTR _DBGCB;                                  /* Debug Comparator B Register; 0x00001812 */
volatile DBGCCSTR _DBGCC;                                  /* Debug Comparator C Register; 0x00001814 */
volatile DBGFSTR _DBGF;                                    /* Debug FIFO Register; 0x00001816 */
volatile SCI2BDSTR _SCI2BD;                                /* SCI2 Baud Rate Register; 0x00001858 */
volatile ADCCV1STR _ADCCV1;                                /* Compare Value 1 Register; 0x00001880 */
volatile ADCCV2STR _ADCCV2;                                /* Compare Value 2 Register; 0x00001882 */
volatile ADCOFSSTR _ADCOFS;                                /* Offset Correction Register; 0x00001886 */
volatile ADCPGSTR _ADCPG;                                  /* Plus-Side Gain Register; 0x00001888 */
volatile ADCMGSTR _ADCMG;                                  /* Minus-Side Gain Register; 0x0000188A */
volatile ADCCLP4STR _ADCCLP4;                              /* Plus-Side General Calibration Value 4 Register; 0x0000188E */
volatile ADCCLP3STR _ADCCLP3;                              /* Plus-Side General Calibration Value 3 Register; 0x00001890 */
volatile ADCCLM4STR _ADCCLM4;                              /* Minus-Side General Calibration Value 4 Register; 0x00001898 */
volatile ADCCLM3STR _ADCCLM3;                              /* Minus-Side General Calibration Value 3 Register; 0x0000189A */

/*lint -restore */

/* EOF */
